l = [22, 33, 44] # функции высшего порядка

# n = (map(str, l)) # str(map...)переводим в строковое значение функции мэп, в функции мэп применяются только функции
# print(next(n))
# print(next(n))
# print(next(n))
# n1 = [str(i) for i in l] # переводим в строковое значение функции мэп
# print(n, n1)

# def power(n):
#     return n * 2
# n = list(map(power, l)) # list превращает в списки. Функцию пауэр нельзя заменить ничем, кроме лямба функции
n = list(map(lambda n: n * 2, l))# Если заменяем лямбда, то деф и ретерн уже не нужны
print(n) # лямбда выполянется столько раз, сколько объектов
# print(next(n))
# print(next(n))
# print(next(n))




