# '''ФУНКЦИЯ - ГЕНЕРАТОР''' генератор экономит память

def gen(n):
    i = 0
    while i < n:
        i +=1
        yield i #  возвращает значение ай, но функцию не заканчивает а каждый раз выдает ай. всегда возвращает только 1 значение

res = gen(5)
print(res)
print(next(res))
print(next(res))
print(next(res))
print(next(res))
print(next(res))
# print(next(res)) # 6 итерация останавливает функцию, так как у нас рес до 5.

# генератор движется только вперед . Генератор экономит память

"""выражение - генератор"""

result = (i for i in range(10)) # так как в круглых скобках это не лист компрекеншен и выражение генератор
print(result)