"""КОРТЕЖИ (tuple)"""

""" Кортеж - упорядоченный набор неизменяемых объектов"""
from string import ascii_lowercase #  ascii_letters, ascii_digit # все буквы латинского алфавита в нижнем регистре
from string import ascii_letters

print(ascii_lowercase) # все маленькие латинского алфавита
print(ascii_letters) # все большие латинского алфавита
# print(ascii_digit) # все цифры.
print
t = 22
tp = (22, 33, 44) # создаем кортеж (кортеж в круглых скобках, списки в квадратных). его нельзя ни нарастить не уменьшить, он неизменяемый. но работают ВСЕ операции, применяемые со списками, функции len, все функции справочные по строкам, которые ранее проходили работают. Функции изменяющие с кортежом не работают. Это список констант.
print(id(tp[0]))
print(id(t)) # ссылки в этом и предыдущем случае на одну ячейку. Имя ячейки одно и тоже
# tp[0] = 220 не работает
print(tp[1]) # индексы работают только на получение данных из кортежей
print(tp[:-1])
print(tp[::-1])
print(tp) #вывести кортеж
print(type(tp)) # узнать тип данных
print(list(tp)) # лист переводит кортеж в список. В кортеже данные неизменяемы, а в списке изменяемы. И то, ито коллекция. Каждому типу данных соответствует одноименная функция, приводящая к этому типу данных
string = 'qwerty' # тип данных строка, строка итерируемый объект (разделяемый по символам)
lst = list('string') # мы получили из строки список. каждый объект теперь символ нашей строки. разбили посимвольно. но к str применять список нельзя. Из списка сдлеать строку этой функцией нельзя. str применяется только к булевым значениям.
print(lst)
print(type(lst))
print(''.join(lst)) # сделать из списка строку можно только этой функцией
n = 7
print(type(n)) # принт тип данных n
print(n) # покажи n
tps = tuple(string) # переводит строку в кортежи
print(tps)
print(type(tps))
print(''.join(tps)) # тоже переводит в кортежи(только для строкового типа данных, если будут цифры возникнет ошибка). Вытягивает данные и из памяти строки и из памяти кортежа.
print(type(tps))
# ord  - номер объекта в памяти компьютера (оперативной)
print(ord('A')) # латинская - разные объекты памяти (65)
print(ord('А')) # кириллица (1040)
print(ord('\n')) #10
print(ord(' ')) #32
print(chr(1049)) # эта функция работает в обе стороны - здесь показывает букву Й по коду в памяти 1049
# есть смайлики, пустые позиции, арабский алфавит и другие языки. надо подгружать юникод и драйверы для этих библиотек

n = 7
print(type(n))
print(n) # в круглых скобках - инт целочисленное число
n = [7] # может стать элементом списка (лист)
print(type(n))
print(n) # в квадратных скобках лист
n = 7, 8, 9 # питон по умолчанию, так как не указаны скобки создает кортеж
print(type(n))
print(n)

n, m, z = 7, 5, 8 # и в скобках, и без скобок будет кортеж. Пишем в скобках, так как не всегда проходит запись без скобок
print(type(n))
print(n) # печатает из кортежа 1 значение. Присваивается поочередно. Ссылки из коллекции перераспределяются на переменные 7, 5, 8. Предыдущие ссылки и объект tp уничтожается в памяти.

PI = 3.1415926 # число пи. Обычная переменная. Верхний регистр говорит, что это константа
print(type(PI)) # переменная - дробное число
PI = 3.1415926, # кортеж. в кортеже ничего изменить нельзя, можно только получить по нулевому индексу.
print(type(PI))

name, *marks = 'Ivan', 4, 5, 3, 5, 7 # * - оператор. здесь уже не важно сколько бюудет элементов маркс - оценки
print(name)
print(marks) # это список  - к имени относится иван, к оценкам все оценки.

name, *marks, predlast, last = 'Ivan', 4, 5, 3, 5, 7 # * - оператор, который упаковывает данные в множества (список). здесь уже не важно сколько бюудет элементов маркс - оценки
print(name)
print(marks)
print(*marks) #  распаковывает список обратно
print(predlast) # предпоследнее значение списка
print(last) # выходит последний элемент к назначенному  имени списка. забирает с конца по элементу

# tp = ('login', 'password') # кортеж
# print(tp)
# print(id(tp))
# buff = list(tp) # буфер данных, создает новый объект памяти
# print(buff)
# buff[1] = 'qwerty'
# print(buff)
# tp = tuple(buff)
# print(id(tp)) # в кортеже объект памяти меняется, о чем и есть эта задача.
# print(tp) #  по правилам ф8 последняя строка должна быть свободной
print(len(tp))

tp = (22, 33, 44, 22) # создаем кортеж (кортеж в круглых скобках, списки в квадратных). его нельзя ни нарастить не уменьшить, он неизменяемый. но работают ВСЕ операции, применяемые со списками, функции len, все функции справочные по строкам, которые ранее проходили работают. Функции изменяющие с кортежом не работают. Это список констант.
print(tp)
print(len(tp))
print(tp.count(22)) # каунт это не функция а метод, поэтому обязательно через точку надо указывать, где я буду считать
print(tp.index(22))
print(tp[0] == tp[-1]) # функции равны, но каждый будет формировать новыее объекты памяти
print(tp[0] is tp[-1]) # оператор is  - вот этот и этот объект это один и тот же или разные? IS - это сравнение на один и тот же объект (памяти), а равенство значений - это равенствов значений
print(id(tp[0]), id(tp[-1])) # один и тот же айди у значения 22





