# # i = 1
# #
# # while i <= 10:
# #
# #     print(i)
# #
# #     i = i + 1
# #
# # i = 1
# #
# # while i <= 10:
# #
# #     print(i)
# #
# #     i += 1
# #
# # n = 0
# #
# # while n <= 0:
# #
# #     n = int(input("Введите положительное число: "))
# #
# # print(n)
#
# # p = ""
# #
# # while p != "пароль":
# #
# #     p = input("Введите пароль: ")
#
# # n = 7
# #
# # a = 0
# #
# # while a != n:
# #
# #     a = int(input("Угадайте число: "))
# #
# # print(f"Поздравляем, вы угадали! Это число {n}")
# #
# # print("Начинаем выполнение программы!")
#
# # import random
# #
# # n = random.randint(1, 6)  # число 6 входит в диапазон
# #
# # a = 0
# #
# # while a != n:
# #     a = int(input("Угадайте число: "))
# #
# # print(f"Вы угадали! Это число {n}")
#
# # text = input("Введите текст (минимум 5 символов): ")
# #
# # l = len(text)
# #
# # print(l)
# #
# # while len(text) < 5:
# #
# #     text = input("Неверно! Введите текст длиной более 4 символов: ")
#
# # text = input("Введите текст (минимум 5 символов): ") # код не сходится!!! не мой, листинг
# #
# # l = len(text)
# #
# # print(l)
# #
# # while len(text) < 5:
# #
# #     text = input("Неверно! Введите текст длиной более 4 символов: ")
# #
# # print(f"Вы ввели текст {text}. Его длина {l} символов.")
#
# # text = input("Введите текст (минимум 5 символов): ")
# #
# # l = len(text)
# #
# # print(l)
# #
# # while len(text) < 5:
# #
# #     text = input("Неверно! Введите текст длиной более 4 символов: ")
# #
# # print(f"Вы ввели текст '{text}'. Его длина {l} символов.")
#
#
# i = 1
#
# while i <= 10:
#     print(i)
#
#     i = i + 1
#
# while
#
# i = 1
#
# while i <= 10:
#     print(i)
#
#     i += 1
#
# n = 0
#
# while n <= 0:
#     n = int(input("Введите положительное число: "))
#
# print(n)
#
# p = ""
#
# while p != "пароль":
#     p = input("Введите пароль: ")
#
# print("Начинаем выполнение программы!")
#
# n = 7
#
# a = 0
#
# while a != n:
#     a = int(input("Угадайте число: "))
#
# print(f"Поздравляем, вы угадали! Это число {n}")
#
# import random
#
# n = random.randint(1, 6)  # число 6 входит в диапазон
#
# a = 0
#
# while a != n:
#     a = int(input("Угадайте число: "))
#
# print(f"Вы угадали! Это число {n}")
#
# text = input("Введите текст (минимум 5 символов): ")
#
# l = len(text)
#
# print(l)
#
# while len(text) < 5:
#     text = input("Неверно! Введите текст длиной более 4 символов: ")
#
# text = input("Введите текст (минимум 5 символов): ")
#
# l = len(text)
#
# print(l)
#
# while len(text) < 5:
#     text = input("Неверно! Введите текст длиной более 4 символов: ")
#
# print(f"Вы ввели текст {text}. Его длина {l} символов.")
#
# Выведем
# сам
# текст
# и
# его
# длину.
#
# text = input("Введите текст (минимум 5 символов): ")
#
# l = len(text)
#
# print(l)
#
# while len(text) < 5:
#     text = input("Неверно! Введите текст длиной более 4 символов: ")
#
# print(f"Вы ввели текст '{text}'. Его длина {l} символов.")
#
# Одинарные
# кавычки
# внутри
# двойных.
#
# text = input("Введите текст (минимум 5 символов): ")
#
# l = len(text)
#
# print(l)
#
# while len(text) < 5:
#     text = input("Неверно! Введите текст длиной более 4 символов: ")
#
# print(f'Вы ввели текст "{text}". Его длина {l} символов.')


# i = 0 # ,бесконечный цикл
#
# while True:
#     print(i)
#
#     i += 1

# i = 0
#
# while True:
#
#     print(i)
#
#     i += 1
#
#     if i > 100:
#
#         break

# t = "Это тестовая строка текста." # первый символ т в тексте. Э - нулевой символ
#
# print(t.find("т"))

# t = "Это тестовая строка текста." # непонятна суть этой операции
#
# print(t.find("т", 10))

# t = "Это тестовая строка текста."
#
# print(t.find("*", 10))

# t = "Это тестовая строка текста."
#
# print(t.index("я"))

# t = "Это тестовая строка текста."
#
# print(f"Индекс точки {t.index(".")}")

# t = "Это тестовая строка текста."
#
# print(f"Индекс звездочки {t.index("*")}")

# t = "Это тестовая строка текста."
#
# print(t.replace("с", "ф"))
#
# t = "Я люблю яблоки, потому что яблоки вкусные."
#
# print(t.replace("яблоки", "апельсины"))

# s = "Удалены все восклицательные знаки!!!"
#
# print(s.replace("!", ""))

# s = "Посчитаем количество пробелов в этой строке."
#
# print(s.count(" "))
#
# s = "Мои питомцы: кошка Сима, кошка Рита, кот Кекс"
#
# print(f"У меня есть {s.count("кошка")} кошки.")

# s = "Имена сотрудников: Артём Иванов, Егор Нестеров, Артём Филатов, Артём Синицын"
#
# print(f"Индекс двоеточия {s.find(":")}")
#
# print(f"В нашем отделе {s.count("Артём", s.index(":"))} Артёма.")

# t = "  Это тестовая строка текста.  "

# t = "Миша и Маша"
#
# print(t.lower())

# t = "Миша и Маша"
#
# print(t.upper())

# t = "Миша и Маша"
#
# print(t.capitalize())
#
# t = "LADA Granta"
#
# print(t.startswith("LADA"))
#
# if t.startswith("LADA"):
#
#     print("Это автомобиль марки LADA")
#
# print(t)
#
# print(t.strip())

# t = "65 см"
#
# print(t.endswith("см"))
#
# if t.startswith("см"):
#
#     print("Это размер в сантиметрах")


# t = "65 см"
#
# print(t.endswith("см"))
#
# if t.endswith("см"):
#
#     print("Это размер в сантиметрах")
#
# elif t.endswith("м"):
#
#     print("Это размер в метрах")
#
# elif t.endswith("мм"):
#
#     print("Это размер в миллиметрах")
#
# elif t.endswith("км"):
#
#     print("Это размер в километрах")

# print('Happy\nNew Year!')
#
# fio = input("Введите ФИО: ")
#
# print(fio.replace(" ","\n"))
#
# fio = input("Введите ФИО: ")
#
# f, i, o = fio.split() #
#
# print(f"Фамилия: {f}")
#
# print(f"Имя: {i}")

# fio = input("Введите ФИО: ")
#
# f, i, o = fio.split()
#
# s = f"| {f} | {i} | {o} |"
#
# print(s)

fio = input("Введите ФИО: ")

f, i, o = fio.split()

s = f"| {f} | {i} | {o} |"

print("-" * len(s))

print(s)

print("-" * len(s))

print(f"Отчество: {o}")

