"""Множества (тип данных - set)"""

"""Множества - набор неупорядоченных уникальных значений (неизменяемых объектов)""" #, у них нет индексов, по индексам нельзя получить элемент коллекции.
"""Множество - это коллекция, которая пищется в фигурных скобках"""
# ls = [] # так обозначается пустой список. пустое множетсво так обозначать нельзя.
# st = set() # так обозначается пустое множество
# st = {22, 33, 44, 44}
# print(st) # питон ставит каждое значение на определенное место, добраться дом места этого значения мы не можем. В множестве не может быть 2 одинаковых объекта. Элементами множества могут быть все переменные и кортеж, все, больше ничего.
# ls = [22, 33, 44, 44]
# st = set()
# st = set(ls) # из списка делаем множество функцией set
# # print(st) # выводится список данных, точно совпадающий принта с данными ввода списка.
# # st.clear() # очищаем список
# # print(st)
# st.add(100) # добавить число 100 в начало множество, но необязательно в начало. Распределяет не по значению числу, а по цифровому коду
# print(st)
# # st.update('old') # внутрь этой функции в скобки можно положить: список, кортеж, множества, какую-то коллекцию. переменная захоидт как объект
# # print(st) # раскидывает значение по буквам в произвольное место
#
# st.update({'old', 32}) # множество из двух объектов, добавление в основное множество - результат невложенное, а сложением как конкатенация. можно по этому методу загрузить любую коллекцию
# print(st)
#
# n = st.pop()# применяется очень редко. Удаляет первое значение в множестве, какое попадется.
# print(st)
# print(n)
#
# # try:
# #     n = int(input())
# # except ValueError as err:
# #     print(err)
#
# # st.remove('old1') # этот метод, можно не использовать. Применяется с конструкцией трайэпсет. удаляет тот объект, который нам нужен. Но если его в списке нет, то получим ошибку
# # st.discard('old') # если есть значение удаляем, если значения нет, то ошибки не будет
# # print(st)
# try:
#     st.remove('old1')
# except ValueError as err:
#     print(err)
# except KeyError as err:
#     print('Ошибка по ключу', err)
# except Exception as err:
#     print(err)
#
# try: # ветка try всегда идет с except
#     st.remove('old')
#     n = int(input('> '))
#     if n == 100:
#         raise TypeError('Ошибка типа данных') # сами формируем ошибку, которую выведет программа
# except ValueError:
#     print('Ввод символьного значения')
# except KeyError as err:
#     print('Ошибка по ключу', err)
# except Exception as err:
#     print(err)
# else: #если ошибка не произошла, выполняется елсе
#     print('Ok')
# finally:
#     print('всегда') # выполняется всегда

"""каждая хэш таблица создает под конкретный объект по факту изменения или удаления множества значений"""
"""хэш-таблицу изучать не будем, она позволяет по константному времени находить элемент коллекции. в списке надо перебирать каждое значение, в множестве значение находится за 1 действие, что намного быстрее"""
"""под эту структуру данных хэш таблицы попадает и множество, и словари. И это позволяет осуществлять быстрое нахождение объекта, так как оно неупорядоченное по хэш-ключу который формируется. Производится внутренее перекодирование строки в значение памяти или присваивается значение, по которому находится результат"""
# самая медленная коллекция - это список, чуть быстрее кортеж (поиск по инлексу достаточно быстрый, работает быстрее, в том числе и в списке). В памяти формируется 15% памяти запасом расширенная память. Все адреса ссылок на объекты в списке расположены подряд. И питон ищет новый объем чистой памяти, куда можно внести ссылки. в какой-то момент происходит перепись списка и перенос в другой объем памяти, если памяти не хватает.
# самая быстрая коллекция - множества и словари. Потому что для кортежа строго определены места расположения в памяти компьютера, они не изменяются.

st1 = {1, 2, 33}
st2 = {1, 2, 44}
res = st1.union(st2) # объединение множеств. Добавить к одному множеству второе. Добавлятеся только отсутствующий элемент 2 множества в конце. Одинаковые числа не дублируются (одинаковые числа - пересечения называются)
print(res)

res = st1 | st2 # та же операция, что и выше только через вертикальный слеш
print(res)
res = st1.intersection(st2)# пересечения множеств
print(res)
res = st1 & st2 # та же функция выводит пересечение множеств
print(res)
# вычитание множеств, два варианта, одинаковые по сути, разные по записи. Вычитается из первого множества пересечения, выводит оставшиеся данные
res = st1.difference(st2)
print(res)
res = st1 - st2
print(res)

res = st1.symmetric_difference(st2) # симметрическая разница между двумя множествами
print(res)
res = st1 ^ st2 # другая запись симметрической разницы
print(res)

st1 = {1, 2, 33}
st2 = {1, 2, 44}
st3 = {1, 2} # является подмножеством и ст 1 и ст2, так как полностью входит в эти множества. А ст1 и ст2 является супермножеством по отношению к ст3

print(st3.issubset(st1)) # является ли оно (ст3) подмножеством ст1? Да, True
print(st1.issuperset(st3)) # является ли ст 1 супермножеством для ст3? Да. Результат один у двух методов, смысл различается
