# Задание.
# # Добавьте функцию для изменения цвета фона холста. Это позволит пользователю выбирать цвет фона, на котором будут рисоваться фигуры, делая рисунок более индивидуализированным и интересным.
# # 1. Добавьте текстовое поле для ввода цвета фона.
# # 2. По умолчанию добавьте в поле ввода белый цвет.
# # 3. Добавьте кнопку “Изменить цвет фона”.
# # 4. Реализуйте функцию, которая изменяет цвет фона холста в соответствии с введенным пользователем значением.

from tkinter import *
import tkinterweb

window=Tk()
window.geometry('300x400')
window.title('Рисование фигур')
window.mainloop()