# Дан код, который выводит список [4, 5, 6, 7, 8, 9]
#
# s = [x for x in range(10) if x > 3]
# print(s)
# Сделайте программу, которая выводит список [10, 9, 8, 7, 6, 5]

# начинаем с 11-1 до больше равно 5 с шагом 1
# s = [x for x in range(11) if x >= 5]
# s.reverse() # перевернуть список
# print(s)
# Дан
# код, который
# выводит
# список
# слов, начинающихся
# на
# букву “м”

# Сделайте
# программу, которая
# выводит
# список
# слов, оканчивающихся
# на
# букву “е”
# words = ["море", "солнце", "майка", "отпуск"]
#
# a_words = [i for i in words if i.endswith('е')]
#
# print(a_words)

# Создайте два списка из 5 элементов с приятными словами и сделайте на их основе генератор комплиментов, который будет выдавать случайные фразы, выбирая первое слово из первого списка, а второе слово из второго списка.
# # Вот примерные результаты работы программы:
# # Ты блистательно прекрасна!
# # Ты неотразимо мила!
# # Ты восхитительно прекрасна!
# # Ты неотразимо красива!
# import random
# words = ['Ты блистательно ', 'Ты прекрасно ', 'Ты неотразимо ', 'Ты восхитительно ', 'Ты замечательно ']
# compliments = ['мила!', 'прекрасна!', 'красива!', 'обаятельна!', 'очаровательна!']
# part1 = random.choice(words)
# part2 = random.choice(compliments)
# print(part1 + part2)

# import random
# words = ['Ты блистательно ', 'Ты прекрасно ', 'Ты неотразимо ', 'Ты восхитительно ', 'Ты замечательно ']
# compliments = ['мила!', 'прекрасна!', 'красива!', 'обаятельна!', 'очаровательна!']
# part1 = random.choice(words)
# part2 = random.choice(compliments)
# print(part1 + part2)

n = input('Напишите как Вас зовут: ')
print(n)
while True:
    if n=='Руслан':
        print('Приветик солнечное солнце!')
        s = input('Воистине не знаю, чем являетесь вы. Выясним. Ответь на вопрос, ты покушать любишь: ')
        if s =='Да':
            print('Ты - гурман!!!')
        if s =='Нет':
            print('Все любят покушать! Не обманывай))) Ты - стесняшка!')
            d = input('Дай отгадаю, что ты любишь больше всего. Выбери и напиши (друзей/играть/гулять): ')
                if d == 'друзей:



