"""СЛОВАРИ (тип данных dict). Основа словарей - хэш таблица, индексы отсутствуют"""
""""""
"Значение можно менять, ключ НЕТ!"
"""словарь - набор неупорядоченных пар (ключ: значение), в которых ключ уникален. В одном словаре не может быть 2 плюмбума, 2 аурума"""

d = {} # пустой словарь
d = {'Pb': 'свинец', 'Au': 'Золото'} # значением может быть любое слово, все определяется ключами
print(d['Au']) # из любой коллекции мы достаем черех квадратные скобки. Только у индекса и списка и у кортежа мы достаем по индексам, а здесь по ключу
print(d.get('Pb'))  #делает тоже самое, в случае отсутствия ключа выводит ноне
print(d.get('Pb1', 'нужный объект')) # вместо отсутствующего значения выводит второй аргумент "нужный объект"
# программа не вылетает, он не дает ошибки. Используется вместо ошибки, но может использоваться намного глубе
d['Pb'] = 'Свинец' # присвоить новые значения словарю
d['Fe'] = 'Железо' # к ключу присваиваем новое значение в новую ячейку памяти, добавляется пара. Создаем новую пару. В существующем ключе мы мьеняем его значение.
print(d)
d.setdefault('Pb', 22) # этот метод защищает от присвоения знаения какого либо по существующему ключу
print(d)
d.setdefault(2, 22) # не существующее значение (2) добавляется в список (ключ: значение). Этот метод еще и возвращает значение по этому ключу
print(d)

n = d.setdefault('2', 22) # не существующее значение (2) добавляется в список (ключ: значение). Этот метод еще и возвращает значение по этому ключу
print(n) # Этот метод еще и возвращает значение по этому ключу если оно есть. если нет создает пару и возвращает значение доабвленного ключа
d.update({3:33, 2:222}) # вставляем любой словарь. присваивает новое значение ключу, если ключ есть и добавляет новое значение и ключ, если такого ключа нет
key = 'Pb'
print(d[key])

print(d)

# методы удаления из словаря
n = d.pop(key) #удаляет первый ключ в словаре
print(n)
n = d.pop('Fe') #удаляет первый ключ в словаре
print(n)

nn = d.popitem() # удаляет последнюю добавленную пару в словарь (в нашем случае 3:33)
print(n, nn) # выводит ответ в виде кортежа
print(d)

print(d.keys()) # выводит список ключей, все три метода выводит одинаково ключи
print(list(d.keys()))
print(list(d))

print(list(d.values())) # выводит только значения словаря
print(list(d.items())) # получаем список вложенных кортежей
for k in d:
    print(k) # получаем только ключи
for v in d.values(): # поулчаем значения из кортежей
    print(v)

for k, v in d.items():
    print(k, v) # итерируем ключ и значение, распаковывая полностью список

l = [22, 33, 44] # имена должны быть уникальными
dd = dict.fromkeys(l,'my item')
print(dd) # элементы списка стали ключами словаря. Значения остутствуют, но мы можем их добавить

dd = {i:i**2 for i in range(10, 20)} # i:i**2 - это новая пара ключ значение, возведение в квадрат с 10 до 20, не включая
print(dd) # дикт компрехеншн (выше строкой)

ls = [('Pb1', 'Свинец'), ('Au1', 'Золото'), (21, 22)] # список кортежей
dd = dict(ls) # из кортежа получается словарь
print(dd)

# цикл фор перебирает по ключам и выводит их значение, айтимс перебирает и выводит и ключи, и значения
# Если мы хотим итерировать по ключам пишем имя словаря
# Если мы хотим итерировать по значениям пишем value
# Если мы хотим итерировать и то, и другое - айтимс. По каждому значению создается кортеж





