""" СПИСКИ (LIST - ТИП ДАННЫХ)"""
import random
# from random import random
#
# """СТРУКТУРА ДАННЫХ - МАССИВ"""
# from copy import deepcopy
# # print(__doc__)
# """Список  - упорядоченный набор объектов (любых символов, значений) от наименьшего к большему - размещение имеет определенный порядок"""
# """      0  1   2   3   4    - здесь индексы имеет каждый объект. Есть отрицательная нумерация индексов"""
nums = [22, 33, 44, 55, 99]
# # """      -5 -4  -3  -2  1"""
# # print(nums[-3]) # принт название коллекции и в кв. скобках значение индекса. и положительная и отрицательная индексация присутствует одновременно.
# # print(nums[3])
# # # по этим объектам можно сделать срез как и в строках, могут быть целочисленные, так и дробные числа, буквы, символы. В список может входить вложенный список. В коллекции данные могут быть смешаны.Любые типы данных. У классических массивов этого нет, в других языках данные одного типа.
# # print(nums[-3:0:-1]) # -1шаг, -3 0 - индексы. Здесь  -3 движется в левую сторону (-1). Индекс -3, -4, -5 и т.д. Если шаг один движемся вправо, влево шаг -1, не важно положительное значение чисел или отрицательное. Математические действия не работают в подсчете индексов.
# # print(nums[2::-1]) # значение конца не прописано.
# # print(nums[2:]) # от 2 индекса до конца с шагом 1.
# # print(nums[::-1]) # инверсия коллекции ( в обратную сторону вся коллекция). реверсивный вывод информации. Формирует новый объект памяти, новую коллекцию. любой срез формирует новый список.
# # nums = [20, 30, [40, 50]] # функция len. Здесь всего три объекта - вложенный список 1 объект
# # s = nums
# # s = nums.copy() # (поверхностное копирование) создать аналогичный объект памяти, создать новый код, который ссылается на те же объекты, меняется только ссылка на новое значение в дальнейшем.
# # s = nums[:] # создает новые объект памяти от нулевого до последнего, тоже самое что deepcopy
# # s = deepcopy(nums) # присваивается новая ячейка памяти данных
# # nums[0] = 200 # dc
# # nums[-1][0] = 400# таким образом первые кв скобки показывают вложенный список, а вторые нулевой объект вложженного списка
# # print(nums)
# # print(id(nums))
# # print(id(s)) # айди - идентификационный номер коллекцтт
# # print(s)
#
# # nums = [22, 33, 44, 55, 99]
# # nums[:3] = 10, 20, 30 # каскадное присвоение новых значений по индексам от 0 до 3 (0, 1, 2)
# # print(nums)
# #
# # ls = [10, 'Dasha', 5.45, True, [67, 'Andre']] # массив так выглядеть не может, это - список. В массивах можно использовать только один тип данных - целочисленный, флоат булевые или стр.
# # lst = [['Маша', 18], 'Даша', 22] # строка, список lst - вложенный список
# # name = ['Masha', 'Dasha'] # массив
# # age = [18, 22]
# # print(name[0], age[0])
# # nums = [22, 33, 44, 22, 55, 99]
# # nums.append([100, 300]) # сокращенная операция, используем чаще. Временная сложность 0(1) - константная сложность, это значит операция выполняется быстро
# # nums.insert(0, 200) # вставить число по нулевому индексу. Линейная сложность операции перенос числа с одного индекса на другой
# # # nums.extend([1, 2]) # эта операция объединяет как конкатенация
# # # nums += [1, 2] # это тот же объект, как и предыдущий, он просто переопределяется
# # # nums = nums + [1, 2] # - это будет новый объект в памяти
# #
# # nums.pop() # если не указываем индекс, удаляется последний элемент, действует во всех коллекциях сложность временная константная
# # n = nums.pop() # удаляет значение
# # nn = nums.pop(3) #  скобках индекс 3, удаляем значение по индексу
# # nums.remove(22) # удаление самого числа по значению. Удаляет только одну копию числа, первая слева направо по ближайшему индексу
# # # while 22 in nums: # не if что то другое, какой-то оператор вхождения не видно какой
# # #     nums.remove(22)
# # nums.remove(55)
# # print(nums.index(22, 1)) # начинаем с 1 индекса, не с нулевого
# # print(nums.count(200)) # сколько раз встречается число 200
# # print(sum(nums)) # сумма всех чисел
# # print(max(nums)) # самое большое значение
# # print(min(nums)) # самое маленькое значение
# # nums.reverse()  # айди не меняется, она совпадает. В срезе айди меняется. Здесь айди неизменный, память уменьшается
# # nums.sort() # сортировка от самого маленького к самому большому.  айди совпадают, новый список не создается.
# # nums.sort(reverse=True) # перевернуть сортировку от большего к меньшему
# # print(id(nums))
# # print(nums)
# # print('n ==', n, 'nn ==', nn )
# # # print(len(nums))
# # # del(n) # удалить переменную их памяти. Удаляет ссылку на объект
# #
# # nums = [] # это пустой список
# # n = float (input('>'))
# # while n != -273:
# #     nums.append(n)
# #     n = float (input('>'))
# # print(f'min ={min(nums)}\nmax = {max(nums)}\nmean = {sum(nums)/len(nums)}') # mean = {sum(nums)/len(nums)}') - поиск среднего арифметического
# #
# # nums = [] # это пустой список
# # n = 0
# # while n != -273:
# #     n = float(input('>'))
# #     nums.append(n)
# # nums.pop
# # print(f'min ={min(nums)}\nmax = {max(nums)}\nmean = {sum(nums)/len(nums)}') # mean = {sum(nums)/len(nums)}') - поиск среднего арифметического
#
# nums = [22, 33, 44, 55, 99] # список мы скорее всего будем итерировать и терация с кортежами чаще всего проходит через цикл фор
# # итерация по индексам
# # for i in range(len(nums)): #  получим индексы 0, 1, 2, 3, 4
# #     print(i, nums[i], end="    ") # отображается индекс числа и само число
#
# # итерация по значениям
ls = [2, 3, 4, 5, 9]
# # for i in range(len(ls)): #  получим индексы 0, 1, 2, 3, 4
# #     print(i, ls[i], end="    ")
#
# # и либо две последние строки
# # cnt = 0
# # for i in range (len(nums)):
# #     print(i, nums[i], ls[i], end="    ") # по одному индексу получается 2 цифры, количество индексов должно совпадать, если их больше выйдет ошибка
# # print()
# # for i in nums:
# #     print(cnt, i, end=" ") #  в этом варианте нет возможности работать по индесам, только по значениям
# #     cnt += 1 # в этом случае можно посчитать индексы по списку функция кнт
# #
# # for i in enumerate(nums):
# #     print(i, end='    ') # кортежи - в скобках - индекс и число (0,22) (1,33) и т.д.
#
# # альтернатива:
# # print(list(enumerate(nums))) # список вложенных кортежей
# # for i in enumerate(nums): # функция енумерейт формирует кортежи (коллекция)
# #     print(i[0], i[1], end='    ') # первый индекс 0, второй индекс 22 таб, нулевой индекс вложенного кортежа 1, второй 33.
# #
# # for i, j in enumerate(nums): # самая быстрая распаковка кортежа
# #     print(i, j, end='   ')
# # print()
#
names = ['Fedor', 'Alisa', 'Sasha', 'Glasha', 'Masha']
# names.sort()  # сортировка списка по алфавиту
# for n, name in enumerate(names, 1):  # функция энумерэйт  - если в конце поставить 1, если нужно нумеровать не с нуля, а с любой цифры, у нас с 1.
#     print(f' {n}. {name}') # выйдет ответ с точкой . Пример: 1. Маша
#
# for i in zip(names, ls): # функция зип выводит кортежи, но она выбирает ондоиндексные элементов двух разных списков. она автоматов обрезает лишние индексы
#
#     print(i, end=' ')
#
# for i, j in zip(nums, ls):  # функция зип выводит кортежи, но она выбирает ондоиндексные элементов двух разных списков. она автоматов обрезает лишние индексы
#     print(i - j) # вычитает список из списка

# генерация случайных вещественных чисел
# print(random.random()) # генерится от 0 до 1 , не включая 1 # функция не работает нет библиотеки! импорт всегда пишем вначале программы - импорт библиотеки генератора случайных чисел рандом
# print(random())
# print(random.uniform(-100, -99)) #работают одинаково, но здесь можно задавать дробные значения от а до б ограничения
#
# # генерация целых чисел случайных
# print(random.randint(2, 10)) #генерация целых чисел между 2 и 10 и 10 входит. Особенность метода ранднит только в пайтоне
# print(random.randrange(2, 100, 2)) # генерация четных чисел
# print(random.randrange(2, 100, 3)) # генерация чисел кратных трем
#
# # случайный выбор из коллекции
# print(random.choice(nums))  # случайный выбор из коллекции нумс
# print(random.choice(names))
# print(random.choice(range(1, 10, 3))) # случайно выбирает индекс, по нему вытягивает из коллекции значение (объект).. Генерирует только 1 значение.
#
# # генерация коллекций случайных объектов
#
# print(random.choices('абвгдежз', k=4)) # выбрать 4 значения рандомно из списка
# print(random.choices(names, k=8)) # не факт, что они не будут повторяться
# print(random.sample(names, 3)) # этот метод обеспечивает уникальность генерируемых индексов. А так генерирует как и предыдущая только без повторов. Строго не больше количества объектов в количестве
# print(random.sample(names, len(names))) # генерация по длине цикла

# a = 'I like python, it is very useful for data analysis'
# b = 'python is the best tool for dealing with big data'
# # выписать вторую строку без слов в первой строке
#
# c = []  # с строка
# a = a.replace(',', '') # убираем знак запятой, исключаем, на каждый знак пишем отдельный replace
# print(a)
# a = a.split() # разбиваем по словам (list разбиваем посимвольно, здесь не подходит)
# b = b.split()
# for word in b: # переменная в себе содержит текст, поэтому правильно писать word
#     if word not in a: # если текст не содержит слова (текст) из предложения а
#         c.append(word)  # добавим в строку с. получится список, а нужна строка
# print(' '.join(c))
#
# resalt = [word for word in b if word not in a] #лихт компрекеншен, упрощенный цикл, работает быстрее, вес меньше. Эппенден прописывается перед упрощенным циклом. Условий может быть несколько
# print(' '.join(c)) № # джоин объединение строк
# print(' '.join(resalt))

# resalt = random.sample(range(1000000), 1000000)
# resalt.insert(0, 0) # выводит ноль сразу
# for n, i in enumerate(resalt, 1):
#     print(n, i)
#     if i == 0:
#         break

# пока не изучали
# mytuple1 = (1, 1, 2)
# mytyple2 = (2, 4)
# tpl_tuple = (mytuple1, mytyple2) # вложенные кортежи по очереди
# mylist2 = modify.lastelement(tpl_tuple, 5)

# n = int(input('Введите количество студентов: '))
# data = {} # для кортежа ставим []
# for i in range(n):
#     name, *marks = input('формат: name 4 3 2 5 3:').split() # сплит пробел
#     print(marks)
#     marks = [int(mark) for mark in marks] # переводим строковое значение в число
#     print(marks)
#     # print(name)
#     # print(marks) # выводит строковый тип данных
#     mean = sum(marks) / len(marks)
# #     data.append((name, mean))
# # print(data) # на этапе инпута всегда вводятся строки
#     data[name] = round(mean, 2) #  выводит словарь
# print(data)

s = 'rewiuytqgeoiuytsmlsmfssllkwfk' # строка считаем буквы, сколько раз встречается
print({symb: s.count(symb) for symb in set(s)}) # set позволяет не считать в данном случае считать одни и те же буквы
# set выводит словарь - буква становится ключом, а количество букв становится значением

# принципиальная разница дикт компрехеншн и цикла форс в удобстве применения, скорости и памяти. 29 итераций - считает все значения
res = {}
cnt = 0
for symb in s:
    # for symb in set(s):
    res[symb] = s.count(symb)
    cnt += 1
print(res)
print(cnt)









