"""СТРОКИ, начальный курс."""
from dataclasses import dataclass

# from curses.ascii import isdigit

# from gettext import find
#
# # s = 'Здравствуйте, \'гости\''
# s = 'Здравствуйте, гости!'
# for i in s:
#     print(i, end=' ')
# print(len(s))
# print(s[19])
# print(s[:12])
# print(s[4::-1])
# print(s[::-1])
# s1 = 'казак'
# print(s1[:])
# print(s1[::-1])
# # 101=1*2**+2**0
# #        4  +   1 = 5
# print(__doc__)
# # for i in range(len(s)):
# #     print(i, s[i], end='   ')
#
# if s1 == s1[::-1]:
#     print('yes')
# else:
#     print(s('no'))
#     print(s[4:0:-1])
#
# s = 'Здравствуйте, гости!'
# s1 = '1239877a'
# print(s.isalpha()) # состоит ли строка из буквенных символов
# print(s1.isdigit()) # состоит ли строка из цифр
# print(s1.isalnum()) # состоит ли строка из цифр и/или букв
# print(s1.isspace()) # является ли строка проблелом/содержит ли пробелы
# print(s.isupper()) # все ли в строке буквы прописные
# print(s.islower()) # все ли в строке буквы строчные
# print(s.startswith('Здрав')) #начинается ли строка с данного фрагмента
# print('рав'in s) # входит ли подстрока в строку  вточном вхождении
# print(s.endswith('!')) # заканчивается ли строка на данный знак/выражение
# s1 = (s.lower())
# print(s)
# # print(s.lower())# сделать все буквы маленькими, внее нельзя внести изменения, относится к неизменяем объектам. Ее можно только переопределить.
# print(s.upper()) # сделать все буквы большими
# # s = '\033[4mЗдравствйте, гости!\033[0m' # команда \033[4m выводит только текст - енси код, \033[0m - сбрасывает все предцдущие коды
# print(s)
# print(s.title()) # обеспечивает написание каждого слова с большой буквы
# print(s.capitalize()) # превращает в переменную с первой большой, остальными маленькими
# print(s.center(40)) # выравнивание по центру 40 знакомест для Здравствуйте, гости!
# print(s.rjust(40)) # выравнивание по правому краю
# print(s.ljust(40)) # выравнивание по левому краю
# print(s.swapcase()) # делает маленькие буквы большими и наоборот
# print(s.strip('! ')) # убирает лишние пробелы по краям  и другие знаки по краям фразы
# print(s.rstrip()) # убирает пробелы только справа
# print(s.lstrip()) # убирает пробелы только слева
# print(s.index('т', 7, 11)) # покажи мне индекс переменной. Искать большую или маленькую. В питоне четкое разделение на большие и маленькие буквы - это разные буквы
# print(s.find('т', 7, 20)) # если не находит по верхней команде, выводит -1
# print(s.replace('т', 'Т', 2).replace(',', '.')) # поменять один знак на другой, заменить русские на латиницу, и т.д. Можно ограничить количество замен шагами
# s = 'Здравствуйте,   гости!\n'
# s = s.strip()
# ls = s.split(',  ') # переводит строку в коллекции изменяет строку на список слов по разделителям. . В скобках пробел не пишем
# print(ls) # Это список или по-другому, коллекция. разбивает текст по пробелам.
# print(', '.join(ls)) # собирает строковые объекты списка в строку. Строка - переменная, список - коллекция.
#
# s1 = 'aaa bbb ccc ddd eee fff '
# s2 = '111 222 333 444 555 666 '
# res = ' '
# # aaa 111 bbb 222 ccc 333 ddd 444
# for i in range(0, len(s1), 4):
#     res += s1[i:i+4] + s2[i:i + 4]
# print(res)

# find()

# s = '-3x^2+4x-6=0'   # a=-3, b=4, c = -6  # Домашнее задание
# a_str = s[0:2]      # '-3'
# b_str = s[6:7]      # '4'
# c_str = s[8:10]      # '-6'
# print(a_str, b_str, c_str)
# a = int(a_str)
# b = int(b_str)
# c = int(c_str)
# D = b**2 - 4*a*c
# print(D)

s = 'Строка символов'
print(s[1::2]) # выбрать каждый второй символ при помощи среза
res = []
s = 'Строка символов'
for n, symb in enumerate(s):
    if n % 2 != 0:
        res.append(symb)
print(''.join(res))
print(''.join(symb for n, symb in enumerate(s) if n % 2 != 0)) # тоже самое через лист компрекейшен в одну строку. Энумерейт подбирает автоматически индекс к каждому обхекту строки (символу)
# print(''.join(symb for n, symb in enumerate(s.1) if n % 2 != 0)) # нумерация пойдет с 1 и в ответе будут другие значения. Энумерейт всегда возращает кортеж



