"""ФУНКЦИИ. Функция - это подпрограмма, которая лежит в памяти, и ждет обращения  к ней. ЕЕ обязательно надо позвать, сама без упоминания она не работает!"""
"""функция пишется после того, как мы прописали импорт, перед всем программируемым модулем. Всегда написание функции начинается с def"""
# def proba(): # у функции всегда предусматривается место памяти для параметров
#     print('proba')
#     return 'function' # если есть ретерн это функция, иначе - это процедура
#
# n = proba() # позвали функцию. В питоне не принято разделять функции и процедуры. Если функция ничего не возвращает, она называет процедура. Сделать с этим ничего нельзя.
# print(n)

# по правилам функции сначала пишутся, потом мы с ними начинаем работать
#
# def summator(x=10, y=50): # сумматор - имя функции, x и y параметры функции
#     return x + y # это тело функции оно всегда одно и тоже. функция ото всех каких-либо записей отделяется двумя строками
# # два вида записи ретерн. возвращает результат, в теле можно не указывать аргумент, но в функции они должын быть объявлены
# res = summator(100, 20)
# print(res)
# print(summator(100, 20))
# print(summator()) # называется позиционный аргумент
# print(summator()) # результаты работы функции отличаются по разным входным данным
# print(summator(y=10)) # называется ключевой аргумент
#
#
# def many_args(*args, **kwargs): # мы даем имя переменной, сюда будут входить или отдельные значения или коллекция для упаковки или распаковки
#     print(args)
#     print(kwargs)# показать ключевой элемент
#     return sum(args)
# print(many_args(2, 4, 3, 4, y=20, x=34))
# print(many_args())
# print(many_args(44, 66, c=76)) # выводит три кортежа через *, упаковывает в кортеж, выводит словари

# Область видимости переменных
# Параметры функции и определенные в ней переменные называются локальными
# def number(n, m):
#     print('N = ', n)
#     return n + m
# n = 10
# print(number('Маша +', 'Саша' ))
# print ('N модуля = ', n) # используется модульная n, которая стоит в коде ниже, можем использовать но не можем изменить н модульную
# # n в функции - локальная, n другая модульная, они разные не соотносятся, их нельзя путать, и не связаны между собой
def number(k, m):
    global n #теперь функция не только видит модульную н, но и может ее изменить.
    n +=1 # воспринимается как локальная
    print('N = ', n)
    return str(n) + m # n - строка, переводим в число
n = 10
print(number('Маша +', 'Саша' ))
print ('N модуля = ', n)

# Аннотация не определяет работает функция или нет. Аннотация это описание функции
def is_even(num) -> bool:
    """Определяет четность числа
    Тру - четное, фолс - нечетное"""
    return num % 2 == 0
    # if num % 2 == 0:
    #     return True
    # else:
    #     return False
# print(is_even(4))
# print(is_even.__doc__) # докстрим выводит комментарии в консоль

def choice_event(x, y):
    for i in range(x, y+1):
        if is_even(i): # ожидается булевое значение, подразумевается
            print(i, end=' ')
# choice_event(100, 140)
# рекурсия - вложенная функция
def num2(n):
    if n > 1:
        num2(n-1)
    print(n)
def num1(n):
    if n > 1:
        num2(n-1)
    print(n)
def num(n):
    if n > 1:
        num1(n-1)
    print(n)

num(3) #  в памяти по очереди запускаются 3 функции
# рекурсия выполянется пока не дойдет до выполнения условия , в нашем случае n>1
# """""" формула рекурсивного факториала
# 3! = 1*2*3 = 3*2!
# 2! = 1*2   = 2* 1!
# 1! = 1
# n! = n*(n-1)! формула рекурсии
""""""
# вложенная функция для факториала, запись в 1 функцию с несколькими вложенными
def fact(n):
    if n == 1:
        return 1
    else:
        return n * fact(n-1)
print(fact(5)) # расчет факториала при помощи рекурсии

def name(nm):
    cnt = 0 # вложенная функция видит переменную локальную
    def surname(snm):
        nonlocal cnt # чтобы счетчик локальный считывался примеянется эта команда, глобальная считывается всегда.
        cnt += 1 # снт не является локальной переменной для деф!!!!
        print(cnt, nm, snm)
    return surname
cnt = 100
snm = name('Саша') # замкнулии функцию.
snm ('Petrova')
snm('Sidorova')

snm = name('Mary') # замыкание работает по каждой функции отдельно корректно.
snm ('Petrova')
snm('Sidorova')
snm('Andreeva')

def power(n):
    return n ** 2
n = power(5)
print(n)

n = (lambda n: n ** 2) (5) # упрощенная функция, запись которой можно записать в ретерн
print(n)

