"while"

# i = 0
# while i < 10:
#     i +=1
#     if i == 7:
#         continue # прерывает итерацию, задавая проеврку цикла на дальнейшую работу
#     print(i, end=' ')

# i = 0
# while i < 10:
#     i +=1
#     if i == 17:
#         break # прерывает цикл
#     print(i, end=' ')
# else: # сладкая парочка, else цикла в цикле вайл не имеет смысла без break никакого смысла
#     print('\nDone') # если не срабатывает цикл, то печатает "Done" и выходим на 18 строку
# print('\nEND')

# symbols = input('> ').upper() # перевести символы в большие буквы - эти команды переводят любые буквенные значения в большие  буквы
# while symbols !='END': # цикл закончится только, когда придет слово END
#     print(symbols, end=' ')
#     symbols = input('> ').upper()

# n = int(input('> ')) # подсчет средней температуры
# sm = 0 # сумма
# cnt = 0 # количество
# while n != -1000: # != - это не равно
#     sm += n
#     cnt += 1
#     n = int(input('>>'))
# # print('Средняя температура за период: ', round(sm / cnt, 2)) # round функция округления чисел, 2 - 2 знака после запятой в ответе
# # print(f'Средняя температура за период: {sm / cnt:.2f}') #нотация позволяет написать дв знака после запятой :.2f (fload) - чтобы ответ выходил с пробелами, команды пишем с пробелами
#
# print('Средняя температура за период: "', round(sm / cnt, 2), '"', sep='') # round функция округления чисел, 2 - 2 знака после запятой в ответе, sep убирает пробел
# print(f'Средняя температура за период: \'{sm / cnt:.2f}\'') # строка f пишется с фигурными скобками, экранируем - повторяем после выражения
# если надо в апострофах, то вот так: print(f'Средняя температура за период: {sm / cnt:.2f}')
"""
35 100
71 cm
"""
# print(35, 100, '\n' + str(71), 'cm') # запятая вносит пробел в ответ, + здесь конкатенация, 71 переводим в строку.
# n = 71
# print(35, 100, '\n' + str(n), 'cm')
# print(type(n)) # type  - вывод типа данных
# n = 71
# n1 = 42
# n2 = 33
# print(f'{n1} {n2}\n{n} sm') # через функция ф. Значения берем в фигурные скобки, текст в апострофы

""" sm = 3
123 % 10 = 3 # остаток от деления на 10
    // 10 = 12 % 10 = 2 # целая часть от деления на 10
                //10 = 1 % 10 = 1
                            //10 = 0  № # 3 итерации 
"""
# переводить типы данных моветон, занимает память, стараемся не переводить. С цифрами работа проще, чем со строками.
# n = int(input('> ')) # подсчет цифр и их сумм  - алгоритм парсинга числа (разделения)
# nn = n # сохранение числа котоое обратится в ноль в результате вычислений
# sm = 0
# cnt = 0  # количество
# while n > 0:
#     remince = n % 10 # остаток от деления ремайнс, получаем последнюю цифру числа
#     sm += remince #  прибавляем поулченную цифру в sm
#     cnt += 1 # увеличиваем счетчик на единицу
#     n //=10 # получаем целую часть числа  после отеделения последней цифры
# print(f'В числе {nn} {cnt} ц. суммой {sm}.')

# функция принт не используется для отображения строк, только для отображения чисел

# инвертация числа (пишем наоборот, справа налево после ввода)

# i = -7
# while i < 43:
#     i +=10
#     print(i, end=' ')

# i = input
# input ("Введите пароль: ")
# print(i)
# while

# password = input("Введите пароль (не менее 8 символов): ")
# while len(password) < 8:
#     print("Пароль слишком короткий! Нужно минимум 8 символов.")
#     password = input("Попробуйте ещё раз: ")
# print("Пароль принят!")


# user_input = input("Введите строку с параметрами автомобиля: ")
# parts = user_input.split()
# mark = parts[0]
# year = parts[1]
# mileage = parts[2]
# price = parts[3]
# res = (
#     f"Продается автомобиль\n"
#     f"Марка: {mark}\n"
#     f"Год выпуска: {year}\n"
#     f"Пробег: {mileage}\n"
#     f"Цена: {price}"
# )
# print(res)

# получение наибольшего общего делителя:
"""НОД
36 24 -> 36 - 24 = 12
12 24 -> 24 - 12 = 12
12 12 -> 12=12 -> nod
"""
# import math
# n1 = int(input('> '))
# n2 = int(input('>> '))
# print(f'NOD = {math.gcd(n1, n2)}') # функция нод в библиотеке math
#
# while n1 != n2:
#     if n1 > n2:
#         n1 -= n2  # присвоить значение n1 - n2 = n1
#     else:
#         n2 -= n1 # присвоить значение n2 - n1 = n2
# print(f'NOD = {n1}')

# n = 13 # проверка простого или составного числа
# for i in range(2, n):
#     if n % i == 0:
#         break
# else:
#     print(n)
#
# for n in range(100, 200): # тоже самое, но с периодом от 100 до 200
#     for i in range(2, n):
#         if n % i == 0:
#             break
#     else:
#         print(n, end=' ')

# while True: # тернарный оператор
#     n = input('> ')
#     n1 = input('>>')
#     if n.isnumeric() and n1.isnumeric(): # для арабских и РИМСКИХ цифр. А так тоже самое что isdigit
#         n = int(n)
#         n1 = int(n1)
#     res = n + n1
#     print(f'{'Слово получилось: ' if isinstance(res, str) else "Сумма равна"}{res}')
#     if res == 'stop':
#         break
# while True:
#     time = 'Может быть временем суток' if 0 <= (n := int (input('> ')))<=24 else 'Не может быть временем суток' # не может быть временем суток (условие задачи)
# # в тернарном операторе, который идет через True обязательно надо присвоить num и прописать else
#     print(time)
#     if n < 0:
#         break

print(__doc__)

